hbentel/M5Stack-Unit-CamS3-5MP/components/esp32-camera/target/esp32s3/ll_cam.c
// Copyright 2010-2020 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.

#include <stdio.h>
#include <string.h>
#include "esp_idf_version.h"
#include "soc/system_reg.h"
#include "soc/lcd_cam_struct.h"
#include "soc/lcd_cam_reg.h"
#include "soc/gdma_struct.h"
#if (ESP_IDF_VERSION_MAJOR >= 6)
#include "hal/gdma_periph.h"
#include "hal/gdma_ll.h"
/* SOC_GDMA_PAIRS_PER_GROUP removed in IDF v6; replaced by GDMA_LL_AHB_PAIRS_PER_GROUP */
#define SOC_GDMA_PAIRS_PER_GROUP GDMA_LL_AHB_PAIRS_PER_GROUP
#else
#include "soc/gdma_periph.h"
#endif
#include "soc/gdma_reg.h"
#include "driver/gpio.h"
#include "ll_cam.h"
#include "cam_hal.h"
#include "esp_rom_gpio.h"

#if (ESP_IDF_VERSION_MAJOR >= 5)
#include "soc/gpio_sig_map.h"
#include "soc/gpio_periph.h"
#include "soc/io_mux_reg.h"
#define gpio_matrix_in(a,b,c) esp_rom_gpio_connect_in_signal(a,b,c)
#define gpio_matrix_out(a,b,c,d) esp_rom_gpio_connect_out_signal(a,b,c,d)
#define ets_delay_us(a) esp_rom_delay_us(a)
#endif

static const char *TAG = "s3 ll_cam";

static void IRAM_ATTR ll_cam_vsync_isr(void *arg)
{
    cam_obj_t *cam = (cam_obj_t *)arg;
    BaseType_t hp = pdFALSE;

    typeof(LCD_CAM.lc_dma_int_st) status = LCD_CAM.lc_dma_int_st;
    if (status.val == 0) return;
    LCD_CAM.lc_dma_int_clr.val = status.val;
    if (!status.cam_vsync_int_st) return;

    cam->debug.vsync_isr_count++;
    cam->isr_seq++;

    if (cam->psram_mode && cam->jpeg_mode) {
        // === Autonomous ISR for PSRAM JPEG (multi-buffer) ===
        // Matches ll_cam_prepare_frame() register sequence exactly.

        // --- 1) Stop capture + snapshot EOF count ---
        uint8_t finished_pos = cam->cur_frame_pos;
        uint32_t finished_cnt = cam->cur_eof_cnt;

        if (cam->capturing) {
            LCD_CAM.cam_ctrl1.cam_start = 0;
            // Do NOT use link.stop — legacy path doesn't use it, and it may
            // put GDMA in a state that in_rst + link.start can't recover from.
            cam->capturing = false;
        }

        // Send frame-done to task, OR return buffer to free pool
        if (finished_cnt > 0) {
            cam_frame_done_t done = { finished_pos, finished_cnt, cam->isr_seq };
            if (xQueueSendFromISR(cam->frame_done_queue, &done, &hp) != pdTRUE) {
                // Queue full — return buffer to free pool to prevent leak
                __atomic_fetch_or(&cam->free_mask, (1u << finished_pos), __ATOMIC_SEQ_CST);
                cam->debug.queue_overflow_count++;
            }
        } else if (cam->isr_seq > 1) {
            // No data captured (eof_cnt==0) — return buffer to free pool
            // (skip on very first VSYNC where no buffer was claimed yet)
            __atomic_fetch_or(&cam->free_mask, (1u << finished_pos), __ATOMIC_SEQ_CST);
        }

        // --- 2) Find next free buffer ---
        uint32_t free = cam->free_mask;
        if (free == 0) {
            cam->drops_no_free_buf++;
            if (hp) portYIELD_FROM_ISR();
            return;  // No free buffer — capture stalls until cam_give() frees one
        }

        uint8_t next = __builtin_ctz(free);  // lowest free bit

        // Claim buffer atomically (not free anymore — ISR owns it for capture)
        __atomic_fetch_and(&cam->free_mask, ~(1u << next), __ATOMIC_SEQ_CST);
        cam->cur_frame_pos = next;
        cam->cur_eof_cnt = 0;

        // --- 3) Start next capture ---
        // Perform the same reset sequence as ll_cam_prepare_frame() to ensure clean
        // alignment each frame. cam_reset + cam_afifo_reset flush the LCD_CAM state
        // machine and async FIFO; in_rst + peri_sel reset and re-connect the GDMA channel.
        // At XCLK=10MHz the front porch gives ~3μs budget; these ~10 register writes take
        // ~100ns total — well within budget. Without these resets, cam_start toggling can
        // produce a spurious extra VSYNC interrupt that cuts the next frame short.
        GDMA.channel[cam->dma_num].in.int_clr.in_suc_eof = 1;
        GDMA.channel[cam->dma_num].in.int_ena.in_suc_eof = 1;

        LCD_CAM.cam_ctrl1.cam_reset = 1;
        LCD_CAM.cam_ctrl1.cam_reset = 0;
        LCD_CAM.cam_ctrl1.cam_afifo_reset = 1;
        LCD_CAM.cam_ctrl1.cam_afifo_reset = 0;

        GDMA.channel[cam->dma_num].in.conf0.in_rst = 1;
        GDMA.channel[cam->dma_num].in.conf0.in_rst = 0;
        GDMA.channel[cam->dma_num].in.peri_sel.sel = 5;  // 5 = LCD_CAM (in_rst resets this)

        // Re-apply burst mode (in_rst clears these bits)
        GDMA.channel[cam->dma_num].in.conf0.indscr_burst_en = 1;
        GDMA.channel[cam->dma_num].in.conf0.in_data_burst_en = 1;

        // Repoint GDMA to the next buffer's descriptor chain
        GDMA.channel[cam->dma_num].in.link.addr = ((uint32_t)&cam->frames[next].dma[0]);
        GDMA.channel[cam->dma_num].in.link.stop = 0;
        GDMA.channel[cam->dma_num].in.link.start = 1;

        LCD_CAM.cam_ctrl1.cam_rec_data_bytelen = cam->dma_half_buffer_size - 1;
        LCD_CAM.cam_ctrl.cam_update = 1;
        LCD_CAM.cam_ctrl1.cam_start = 1;

        cam->capturing = true;
        cam->debug.start_trigger_count++;
    } else {
        // === Legacy path: send VSYNC event to task ===
        ll_cam_send_event(cam, CAM_VSYNC_EVENT, &hp);
    }

    if (hp) portYIELD_FROM_ISR();
}

static void IRAM_ATTR ll_cam_dma_isr(void *arg)
{
    cam_obj_t *cam = (cam_obj_t *)arg;
    BaseType_t HPTaskAwoken = pdFALSE;

    typeof(GDMA.channel[cam->dma_num].in.int_st) status = GDMA.channel[cam->dma_num].in.int_st;
    if (status.val == 0) return;
    GDMA.channel[cam->dma_num].in.int_clr.val = status.val;

    if (status.in_suc_eof) {
        cam->debug.eof_count++;

